{"backend": "tensorflow", "keras_version": "2.1.3", "config": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [20, 1], "activity_regularizer": null, "name": "conv2d_5", "activation": "linear", "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "batch_input_shape": [null, 1, 50, 1], "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "dtype": "float32", "filters": 50, "strides": [1, 1], "padding": "same"}, "class_name": "Conv2D"}, {"config": {"pool_size": [1, 4], "trainable": true, "name": "max_pooling2d_5", "padding": "valid", "strides": [1, 4], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "flatten_5"}, "class_name": "Flatten"}, {"config": {"noise_shape": null, "seed": null, "trainable": true, "rate": 0.2, "name": "dropout_5"}, "class_name": "Dropout"}, {"config": {"use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_13", "activation": "relu", "kernel_constraint": null, "units": 30, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_14", "activation": "relu", "kernel_constraint": null, "units": 25, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"stddev": 0.05, "seed": null, "mean": 0.0}, "class_name": "RandomNormal"}, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_15", "activation": "linear", "kernel_constraint": null, "units": 1, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}